Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: With pointer p and distance n, the result of p.advanced(by: n) is equivalent to p + n.
ja: ポインタpと隔たりnでは、p.advanced(by: n)の結果はp + nと同等です。

source: With pointers p and q, the result of p.distance(to: q) is equivalent to q - p.
ja: ポインタpとqでは、p.distance(to: q)の結果はq - pと同等です。

source: Within asynchronous functions, as a “current” task is always guaranteed to exist, this will perform the lookup in the task local context.
ja: 非同期関数の内側では、“現在の” タスクは常に存在することを保証されます、これはタスクローカル文脈における検索を実行するでしょう。

source: Work with fixed-width numeric types of different sizes.
ja: 異なるサイズの固定長数値型を扱います。

source: Work with fixed-width vectors of fixed-width numeric types of different sizes.
ja: 異なるサイズの固定幅数値型の固定幅ベクターを扱います。

source: Work with prefix, postfix, and infix operators.
ja: 前置、後置、および中置演算子を扱います。

source: Work with text using Unicode-safe strings.
ja: ユニコード安全な文字列を使ってテキストを扱います。

source: Working with Encodings
ja: エンコーディングを扱う

source: Working with Paths
ja: パスを扱う

source: Working with String Views
ja: 文字列ビューを扱う

source: Wrap each expression in a string interpolation in parentheses, prefixed by a backslash.
ja: 文字列補間の中の式それぞれを丸括弧で包んで、バックスラッシュを前においてください。

source: Wrap the call in a do-catch statement instead of using an Error? type as a parameter to the completion handler.
ja: 呼び出しをdo-catch文の中に包んでください、Error?型をパラメータとして完了ハンドラに使う代わりに。

source: Wrappers for Algorithms
ja: アルゴリズムに対するラッパー

source: Writable Key Paths
ja: 書き込み可能なキーパス

source: Write generic code that works with any collection, or build your own collection types.
ja: 何らかのコレクションを使って作業する総括的なコードを記載します、またはあなた独自のコレクション型を組み立てます。

source: Write generic code that works with any numeric type.
ja: 何らかの数値型を使って作業する総括的なコードを記載します。

source: Writes a textual representation of this instance into the given output stream.
ja: このインスタンスのテキスト表現を与えられた出力ストリームへ書き出します。

source: Writes the string into the given output stream.
ja: 与えられた出力ストリームへ文字列を書き出します。

source: Writes the textual representation of the Unicode scalar into the given output stream.
ja: ユニコードスカラーのテキスト表現を与えられた出力ストリームに書き出します。

source: Writes the textual representations of the given items into the given output stream.
ja: 与えられた要素のテキスト表現を与えられた出力ストリームに書き出します。

source: Writes the textual representations of the given items into the standard output.
ja: 与えられた項目のテキスト表現を標準出力に書き出します。

source: Writes the textual representations of the given items most suitable for debugging into the given output stream.
ja: 与えられた項目の、デバッグに最も適するテキスト表現を、与えられた出力ストリームに書き出します。

source: Writes the textual representations of the given items most suitable for debugging into the standard output.
ja: 与えられた項目の、デバッグに最も適するテキスト表現を、標準出力に書き出します。

source: Writing to a File or URL
ja: ファイルまたはURLに書き込む

source: Writing to typed memory as raw bytes must only be performed when the bound type is a trivial type.
ja: 型付メモリに生のバイトとして書き込むことは、その束縛型が自明型である場合にのみ実行されるべきです。

source: You also use this method to sort elements that conform to the Comparable protocol in descending order.
ja: あなたはまた、このメソッドを使ってComparableプロトコルに準拠する要素を降順でソートすることができます。

source: You are in charge of managing the allocated memory.
ja: あなたは、アロケートされたメモリの管理を任されます。

source: You are responsible for handling the life cycle of any memory you work with through unsafe pointers to avoid leaks or undefined behavior.
ja: あなたはリークや未定義挙動を避けるために、あなたが安全でないポインタを通して扱うあらゆるメモリの生涯の処理に責任があります。

source: You are responsible for handling the life cycle of any memory you work with through unsafe pointers, to avoid leaks or undefined behavior.
ja: あなたは、リークや未定義挙動を避けるために、あなたが安全でないポインタを通して扱うあらゆるメモリの生涯の処理に責任があります。

source: You can access a string’s view of UTF-16 code units by using its utf16 property.
ja: あなたは文字列の持つビューのUTF-16コード単位にアクセスすることが、それのutf16プロパティを使うことで行えます。

source: You can access a string’s view of UTF-8 code units by using its utf8 property.
ja: あなたは、文字列のもつUTF-8コード単位ビューにそれのutf8プロパティを使うことによってアクセスできます。

source: You can access a string’s view of Unicode scalar values by using its unicodeScalars property.
ja: あなたは文字列の持つビューのユニコードスカラー値にアクセスすることが、それのunicodeScalarsプロパティを使うことで行えます。

source: You can also create Unicode scalar values directly from their numeric representation.
ja: あなたはまた、ユニコードスカラー値を直接にそれらの数値表現から作成することができます。

source: You can also pass a closure property of a generic type or a generic method as long as no generic type parameters are referenced in the closure’s argument list or body.
ja: あなたはまた、ひとつの総称体型のクロージャプロパティまたは総称体メソッドを渡すことが、いくつかの総称体型パラメータがクロージャの引数リストまたは本文において参照されるのでない限りは可能です。

source: You can also use inout syntax to pass a mutable pointer to the elements of an array.
ja: あなたはまた、インアウト構文を使って、可変ポインタを配列の要素へ渡せます。

source: You can also use subscript notation to access the value in memory at a specific offset.
ja: あなたはまた、添え字表記法を使ってメモリ中の値に特定のオフセットでアクセスできます。

source: You can call this generic function with an instance of either String or Substring.
ja: あなたは、この総称体関数をStringまたはSubstringのどちらのインスタンスでも呼び出せます。

source: You can check the equality of instances of any BinaryInteger types using the equal-to operator (==).
ja: あなたは、何らかのBinaryInteger型のインスタンスの同等性を同等演算子（==）使って確認できます。

source: You can check the inequality of instances of any BinaryInteger types using the not-equal-to operator (!=).
ja: あなたは、何らかのBinaryInteger型のインスタンスの不等性を不等演算子（!=）使って確認できます。

source: You can compare instances of any BinaryInteger types using the greater-than operator (>), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより大きい演算子（>）を使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the greater-than-or-equal-to operator (>=), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより大きいか等しい演算子（>=）使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the less-than operator (<), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより小さい演算子（<）を使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the less-than-or-equal-to operator (<=), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより小さいか等しい演算子（<=）使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can confirm the data value’s underlying type by retrieving a non-nil value from stringValue or by inspecting the type property.
ja: あなたは、データ値のもつ基礎をなす型を確認することが、非nil値をstringValueから回収することによって、またはtypeプロパティを調査することによって可能です。

source: You can convert a String.UnicodeScalarView instance back into a string using the String type’s init(_:) initializer.
ja: あなたは、String.UnicodeScalarViewインスタンスを逆にひとつの文字列へと変換することが、String型のもつinit(_:)イニシャライザを使って行えます。

source: You can create a Unicode.Scalar instance by using a string literal that contains a single character representing exactly one Unicode scalar value.
ja: あなたは、Unicode.Scalarインスタンスを、厳密に１つのユニコードスカラー値を表している単一の文字を含んでいる文字列リテラルを使うことによって作成できます。

source: You can create instances of the type by using the static members named after the symbolic names, or by using the init(rawValue:) initializer.
ja: あなたは、この型のインスタンスを、それら象徴名を付けられた静的メンバーを使うことによってまたはinit(rawValue:)イニシャライザを使うことによって作成できます。

source: You can create new strings using string literals or string interpolations.
ja: あなたは新しい文字列を、文字列リテラルまたは文字列補間を使って作成できます。

source: You can expect faster execution when the collections share many common elements, or if Element conforms to Hashable.
ja: あなたはより速い遂行を予想できます、コレクションそれらが多くの普通の要素を共有する場合は、またはもしElementがHashableに準拠するならば。

source: You can expect faster execution when the collections share many common elements.
ja: あなたはより速い遂行を予想できます、コレクションそれらが多くの普通の要素を共有する場合は。

source: You can perform many string operations on a substring.
ja: あなたは、多くの文字列演算を買い文字列上で行えます。

source: You can remove completion handlers by updating these calls to use the async-await versions.
ja: あなたは完了ハンドラそれらを取り除くことがそれらの呼び出しをasync-await版を使うよう更新することで可能です。

source: You can reverse a collection without allocating new space for its elements by calling this reversed() method.
ja: あなたは、あるコレクションを逆順にすることがそれの要素に対して新しい空間を割り当てることなくreversed()メソッドによって可能です。

source: You can send the output of the standard library’s print(_:to:) and dump(_:to:) functions to an instance of a type that conforms to the TextOutputStream protocol instead of to standard output.
ja: あなたは、標準ライブラリのprint(_:to:)およびdump(_:to:)関数の出力をTextOutputStreamプロトコルに準拠する型のインスタンスに送ることが、標準出力に送る代わりに行えます。

source: You can sort any mutable collection of elements that conform to the Comparable protocol by calling this method.
ja: あなたはComparableプロトコルに準拠する要素からなるあらゆる可変の配列をこのメソッドを呼び出すことによってソートできます。

source: You can sort any sequence of elements that conform to the Comparable protocol by calling this method.
ja: あなたはいくらかの要素からなる何らかのシーケンスでComparableプロトコルに準拠するものをこのメソッドを呼び出すことによってソートする（並び替える）ことができます。

source: You can subscript a collection with any valid index other than the collection’s end index.
ja: あなたは、そのコレクションの末尾インデックスの以外のあらゆる有効なインデックスで、コレクションに対して添え字を使うことができます。

source: You can use popLast() to remove the last element of a collection that might be empty.
ja: あなたはpopLast()を使って、空であるかもしれないコレクションの最後の要素を削除できます。

source: You can use a slice’s base property to access its base collection.
ja: あなたはスライスのもつbaseプロパティを使って、それの基盤コレクションにアクセスできます。

source: You can use a type that conforms to the Strideable protocol with the stride(from:to:by:) and stride(from:through:by:) functions.
ja: あなたは、Strideableプロトコルに準拠する型をstride(from:to:by:)およびstride(from:through:by:)関数で使うことができます。

source: You can use an UnsafeBufferPointer instance in low level operations to eliminate uniqueness checks and, in release mode, bounds checks.
ja: あなたは、UnsafeBufferPointerインスタンスを低レベル演算において使うことで、特有性検査をそして、リリースモードでは、境界検査を省くことができます。

source: You can use an UnsafeMutableBufferPointer instance in low level operations to eliminate uniqueness checks and, in release mode, bounds checks.
ja: あなたは、UnsafeMutableBufferPointerインスタンスを低レベル演算において使うことで、特有性検査をそして、リリースモードでは、境界検査を省くことができます。

source: You can use an UnsafeMutableRawBufferPointer instance in low-level operations to eliminate uniqueness checks and release mode bounds checks.
ja: あなたは、UnsafeMutableRawBufferPointerインスタンスを低水準演算において使用することで、固有性検査とリリースモード境界検査を省くことができます。

source: You can use an UnsafeRawBufferPointer instance in low-level operations to eliminate uniqueness checks and release mode bounds checks.
ja: あなたは、UnsafeRawBufferPointerインスタンスを低水準演算において使用することで、固有性検査とリリースモード境界検査を省くことができます。

source: You can use methods like initialize(to:count:), initialize(from:count:), and moveInitialize(from:count:) to initialize the memory referenced by a pointer with a value or series of values.
ja: あなたは、initialize(to:count:)、initialize(from:count:)、そしてmoveInitialize(from:count:)のようなメソッドを使うことで、ポインタによって参照されるメモリをある値または一連の値で初期化できます。

source: You can use methods like initializeMemory(as:from:) and moveInitializeMemory(as:from:count:) to bind raw memory to a type and initialize it with a value or series of values.
ja: あなたは、initializeMemory(as:from:)とmoveInitializeMemory(as:from:count:)のようなメソッドを使うことで、生のメモリをある型に束縛して、それをある値または一連の値で初期化します。

source: You can use the withUTF8Buffer(_:) method to access a static string’s contents, regardless of which representation the static string uses.
ja: あなたは、withUTF8Buffer(_:)メソッドを使うことで、静的文字列のもつ内容にアクセスできます、その静的文字列が使うのはどの表現かに関係なく。

source: You can use the predicate to check for an element of a type that doesn’t conform to the Equatable protocol, or to find an element that satisfies a general condition.
ja: あなたは述部を使うことで、Equatableプロトコルに準拠しない型の要素を調べること、またはある一般的条件を満たす要素を見つけることが可能です。

source: You can use the predicate to check for an element of a type that doesn’t conform to the Equatable protocol, such as the HTTPResponse enumeration in this example.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型、例えばこの例でのHTTPResponse列挙などの要素に対して調べることができます。

source: You can use the predicate to find an element of a type that doesn’t conform to the Equatable protocol or to find an element that matches particular criteria.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型の要素を見つける、または特定の基準に合致する要素を見つけることができます。

source: You can use the same indices for subscripting a string and its substring.
ja: あなたは、文字列とそれの下位文字列での添え字の使用に対して同じインデックスを使うことができます。

source: You can use the unary plus operator (+) to provide symmetry in your code for positive numbers when also using the unary minus operator.
ja: あなたは、単行プラス演算子（+）を使うことで、均整美をあなたのコードにおいて正の数に対して単行マイナス演算子もまた使う場合に提供できます。

source: You can use the unbounded range operator (...) to create a slice of a collection that contains all of the collection’s elements.
ja: あなたは、無境界範囲演算子（...）を使って、あるコレクションのスライスでそのコレクションのもつ要素すべてを含んでいるものを作成できます。

source: You can use this initializer to create a new string from a slice of another string’s unicodeScalars view.
ja: あなたは、このイニシャライザを使って新しい文字列を別の文字列のもつunicodeScalarsビューのスライスから作成できます。

source: You can use this initializer to create a new string from the result of one or more collection operations on a string’s characters.
ja: あなたは、このイニシャライザを使って新しい文字列を、ある文字列のもつ幾らかの文字上での１つ以上のコレクション演算の結果から作成できます。

source: You can use this method to create new values from the buffer pointer’s underlying bytes.
ja: あなたは、このメソッドを使って新しい値をバッファポインタのもつ基盤バイトから作成できます。

source: You can use this type of partial range of a collection’s indices to represent the range from the partial range’s lower bound up to the end of the collection.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、その部分的な範囲の下側の境界からそのコレクションの終わりまでの範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, and including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、そしてそれを含んでいる範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, but not including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、しかしそれを含んでいない範囲を表すことができます。

source: You cannot use * with arguments of different types.
ja: あなたは、*をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use + with arguments of different types.
ja: あなたは、+をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use - with arguments of different types.
ja: あなたは、-をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use a break or continue statement to exit the current call of the body closure or skip subsequent calls.
ja: あなたは、breakまたはcontinue文を使って、bodyクロージャの現在の呼び出しを抜け出したり、または続いて起こる呼び出しを飛ばしたりできません。

source: You don’t have to convert all of your code all at once; instead, you can use specific refactoring techniques to convert your code one piece at time.
ja: あなたは、あなたのコードの全てを一斉に変換する必要はありません；あなたは特定のリファクタリング技法を使ってあなたのコードを一度に一断片ずつ変換できます。

source: You must call a resume method exactly once on every execution path throughout the program.
ja: あなたは、ある再開メソッドをあらゆる遂行経路上でそのプログラムの間を通して厳密に一度だけ呼び出さなければなりません。

source: You must not call this method if any other copy of this iterator has been advanced with a call to its next() method.
ja: あなたは、このイテレータの何か他のコピーがそれのnext()メソッドを呼び出すことで前に進められるならば、このメソッドを呼び出す必要はありません。

source: You suspend the store.save() operation by adding the await keyword.
ja: あなたはstore.save()操作を、awaitキーワードの追加によって一時停止します。

source: You use instances of the UnsafeMutablePointer type to access data of a specific type in memory.
ja: あなたは、UnsafeMutablePointer型のインスタンスを使うことで、メモリにおいて特定の型のデータにアクセスします。

source: You use instances of the UnsafePointer type to access data of a specific type in memory.
ja: あなたは、UnsafePointer型のインスタンスを使うことで、メモリにおいて特定の型のデータにアクセスします。

source: You use the #keyPath string expression to create compiler-checked keys and key paths that can be used by KVC methods like value(forKey:) and value(forKeyPath:).
ja: あなたは、#keyPath文字列式を使って、コンパイラチェック済みのキーおよびキーパスを作成します、それはKVCメソッドvalue(forKey:)やvalue(forKeyPath:)によって使われます。

source: You use the UnsafeMutablePointer type to access and manage memory that has been bound to a specific type.
ja: あなたは、UnsafeMutablePointer型を使うことで、特定の型に束縛されているメモリへのアクセスおよび管理を行います。

source: You use the UnsafeMutableRawPointer type to access and manage raw bytes in memory, whether or not that memory has been bound to a specific type.
ja: あなたは、UnsafeMutableRawPointer型を使ってメモリ中の生のバイトにアクセスおよび管理を、そのメモリが特定の型に束縛されているかどうかにかかわらず行います。

source: You use the UnsafePointer type to access and manage memory that has been bound to a specific type.
ja: あなたは、UnsafePointer型を使うことで、特定の型に束縛されているメモリへのアクセスおよび管理を行います。

source: You use the UnsafeRawPointer type to access and manage raw bytes in memory, whether or not that memory has been bound to a specific type.
ja: あなたは、UnsafeRawPointer型を使ってメモリ中の生のバイトにアクセスおよび管理を、そのメモリが特定の型に束縛されているかどうかにかかわらず行います。

source: You use this method to randomize the elements of a collection when you are using a custom random number generator.
ja: あなたはこのメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、あるコレクションの要素を無作為化します。

source: You use this method to randomize the elements of a sequence when you are using a custom random number generator.
ja: あなたはこのメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、あるシーケンスの要素を無作為化します。

source: You’re tasked with finding the day with the most absences in the second half of the session.
ja: あなたはこの学期の後半において最も多く欠席者がいる日付を見つける任務を負います。

source: Zero is a multiple of everything because 0 = 0*x for any integer x.
ja: ゼロはあらゆるものの倍数です、なぜなら0 = 0*xなので、どんな整数xに対してもです。

source: Zero is the identity element for addition.
ja: ゼロは加算に対する単位元です。

source: a pointer to a null-terminated sequence of UTF-8 code units:
ja: null終端された一連のUTF-8コード単位へのあるポインタ：

source: a single Unicode scalar value, under very limited circumstances:
ja: 単一のユニコードスカラー値、非常に制限された状況のもとで：

source: handle to the task, allowing to await get() on the tasks result or cancel it.
ja: タスクに対するハンドル、それはタスク結果上でawait get()をまたはそれのcancelを可能にします。

source: handle to the task, allowing to await handle.get() on the tasks result or cancel it.
ja: タスクに対するハンドル、それはタスク結果上でawait handle.get()をまたはそれのcancelを可能にします。

source: if a Task running on behalf of an actor, and a new higher-priority task is enqueued to the actor, its current task must be temporarily elevated to the priority of the enqueued task, in order to allow the new task to be processed at–effectively– the priority it was enqueued with.
ja: あるTaskがあるアクターを代表して動作している、そして新しいより高い優先度のタスクがそのアクターへの待ち行列に入れられるならば、その現在のタスクは待ち行列に入れられたタスクの優先度まで一時的に上げられなければなりません、新しいタスクがそれが待ち行列に入れられた - 実質的な - 優先度で処理されるように。

source: if a task is created with a Task.Handle, and a higher-priority task calls the await handle.get() function the priority of this task must be permanently increased until the task completes.
ja: あるタスクがTask.Handleで作成される、そしてより高い優先度のタスクがawait handle.get()関数を呼び出すならば、このタスクの優先度は、タスクが完了するまで永久的に増大されなければなりません。

source: it is generally preferable to use child tasks rather than detached tasks.
ja: 一般的に望ましいのは、子タスクを使うことです、分離されたタスクよりも。

source: operation to execute and add to the group
ja: 遂行するそしてグループに加える演算。

source: override priority of the operation task
ja: 演算タスクの優先度をオーバーライドします。

source: priority of the task
ja: タスクの優先度

source: priority of the task.
ja: タスクの優先度。

source: the executor on which the detached closure should start executing on.
ja: それの上でこの分離されたクロージャが遂行を開始するべきエグゼキュータ。

source: the operation to execute
ja: 遂行する演算。

source: this DOES NOT affect Task.currentPriority().
ja: これは、Task.currentPriority()に影響「しません」。

source: this DOES affect Task.currentPriority().
ja: これは、Task.currentPriority()に影響「します」。
